gicking/STM8_headers/SVD/STM8AF6189.svd
      </registers>
      <interrupt>
        <name>LINUART_TC_TXE</name>
        <description>LINUART_TC_TXE interrupt</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>LINUART_IDLE_LBDF_LHDF_OR_PE_RXNE</name>
        <description>LINUART_IDLE_LBDF_LHDF_OR_PE_RXNE interrupt</description>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>OPT</name>
      <baseAddress>0x4800</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>15</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0010</offset>
        <size>9</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x007e</offset>
        <size>2</size>
        <usage>registers</usage>
      </addressBlock>
      <description>OPT</description>
      <groupName>Option-Bytes</groupName>
      <registers>
        <register>
          <name>OPT0</name>
          <description>Read-out protection (ROP)</description>
          <size>8</size>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPT1</name>
          <description>User boot code (UBC)</description>
          <size>8</size>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPT1</name>
          <description>User boot code (UBC) (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>OPT2</name>
          <description>Alternate function remapping (AFR)</description>
          <size>8</size>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPT2</name>
          <description>Alternate function remapping (AFR) (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>OPT3</name>
          <description>Watchdog option</description>
          <size>8</size>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPT3</name>
          <description>Watchdog option (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>OPT4</name>
          <description>Clock option</description>
          <size>8</size>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPT4</name>
          <description>Clock option (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>OPT5</name>
          <description>HSE clock startup</description>
          <size>8</size>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPT5</name>
          <description>HSE clock startup (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x000A</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>OPT6</name>
          <description>TMU</description>
          <size>8</size>
          <addressOffset>0x000B</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPT6</name>
          <description>TMU (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x000C</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>OPT7</name>
          <description>Flash wait states</description>
          <size>8</size>
          <addressOffset>0x000D</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPT7</name>
          <description>Flash wait states (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x000E</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>OPT8</name>
          <description>TMU_KEY 1</description>
          <size>8</size>
          <addressOffset>0x0010</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPT9</name>
          <description>TMU_KEY 2</description>
          <size>8</size>
          <addressOffset>0x0011</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPT10</name>
          <description>TMU_KEY 3</description>
          <size>8</size>
          <addressOffset>0x0012</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPT11</name>
          <description>TMU_KEY 4</description>
          <size>8</size>
          <addressOffset>0x0013</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPT12</name>
          <description>TMU_KEY 5</description>
          <size>8</size>
          <addressOffset>0x0014</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPT13</name>
          <description>TMU_KEY 6</description>
          <size>8</size>
          <addressOffset>0x0015</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPT14</name>
          <description>TMU_KEY 7</description>
          <size>8</size>
          <addressOffset>0x0016</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPT15</name>
          <description>TMU_KEY 8</description>
          <size>8</size>
          <addressOffset>0x0017</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>OPT16</name>
          <description>TMU_MAXATT</description>
          <size>8</size>
          <addressOffset>0x0018</addressOffset>
          <resetValue>0xC7</resetValue>
        </register>
        <register>
          <name>OPT17</name>
          <description>Bootloader</description>
          <size>8</size>
          <addressOffset>0x007E</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>NOPT17</name>
          <description>Bootloader (complementary byte)</description>
          <size>8</size>
          <addressOffset>0x007F</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
